app/Controllers/Operateur.php

SELECT COUNT(*) AS `numrows`
FROM `historique_transactions`
JOIN `types_operations` ON `types_operations`.`id` = `historique_transactions`.`type_operation_id`
JOIN `comptes_clients` `cs` ON `cs`.`id` = `historique_transactions`.`compte_source_id`
WHERE `types_operations`.`code` IN ('RETRAIT','TRANSFERT')
SELECT `historique_transactions`.*, `types_operations`.`code` as `type_code`, `types_operations`.`nom` as `type_nom`, `cs`.`numero_telephone` as `compte_source_numero`
FROM `historique_transactions`
JOIN `types_operations` ON `types_operations`.`id` = `historique_transactions`.`type_operation_id`
JOIN `comptes_clients` `cs` ON `cs`.`id` = `historique_transactions`.`compte_source_id`
WHERE `types_operations`.`code` IN ('RETRAIT','TRANSFERT')
ORDER BY `historique_transactions`.`effectue_le` DESC
 LIMIT 10
---
    public function gains(): string
    {
        $historiqueModel = new HistoriqueTransactionModel();

        // Récupérer les gains séparés par réseau (interne vs externe)
        $gainsSepares = $historiqueModel->obtenirGainsSepares();

        // Récupérer le détail des transactions avec pagination
        $pager = \Config\Services::pager();
        $perPage = 10;
        $page = $this->request->getVar('page') ?? 1;
        $filter = $this->request->getVar('filter') ?? 'all';

        $query = $historiqueModel->select("historique_transactions.*, (historique_transactions.frais_bareme + historique_transactions.frais_commission) as frais_percus, types_operations.code as type_code, types_operations.nom as type_nom, cs.numero_telephone as compte_source_numero, COALESCE(historique_transactions.numero_destinataire, cd.numero_telephone) as numero_destinataire_affiche, CASE WHEN types_operations.code != 'TRANSFERT' THEN 'Notre Réseau' WHEN od.est_interne = 1 THEN 'Notre Réseau' WHEN od.nom IS NOT NULL THEN 'Autres Opérateurs (' || od.nom || ')' ELSE 'Opérateur inconnu' END as reseau_concerne")
                                 ->join('types_operations', 'types_operations.id = historique_transactions.type_operation_id')
                                 ->join('comptes_clients cs', 'cs.id = historique_transactions.compte_source_id')
                                 ->join('comptes_clients cd', 'cd.id = historique_transactions.compte_destination_id', 'left')
                                 ->join('operateurs od', 'od.id = historique_transactions.operateur_destination_id', 'left')
                                 ->whereIn('types_operations.code', ['RETRAIT', 'TRANSFERT']);

        if ($filter !== 'all') {
            $query->where('types_operations.code', $filter);
        }

        $transactions = $query->orderBy('historique_transactions.effectue_le', 'DESC')
                            ->paginate($perPage, 'default', $page);

SELECT *
FROM `bareme_frais`
WHERE `type_operation_id` = '1'
---
    public function bareme($typeOperationId)
    {
        $typeOperationModel = new TypeOperationModel();
        $baremeModel = new BaremeFraisModel();

        // Récupérer le type d'opération
        $typeOperation = $typeOperationModel->find($typeOperationId);

        if (!$typeOperation) {
            return redirect()->to('/operateur/operations')->with('error', 'Type d\'opération non trouvé');
        }

        // Récupérer les barèmes de frais pour ce type d'opération
        $baremes = $baremeModel->where('type_operation_id', $typeOperationId)->findAll();