app/Models/HistoriqueTransactionModel.php

SELECT *
FROM `vue_situation_gains`
---
    public function obtenirSituationGains()
    {
        $db = \Config\Database::connect();
        return $db->table('vue_situation_gains')->get()->getResultArray();

SELECT *
FROM `vue_historique_portefeuille_clients`
WHERE `compte_concerne_id` = 1
ORDER BY `effectue_le` DESC
---
    public function obtenirHistoriqueClientVue($compteId)
    {
        $db = \Config\Database::connect();
        return $db->table('vue_historique_portefeuille_clients')
                    ->where('compte_concerne_id', $compteId)
                    ->orderBy('effectue_le', 'DESC')
                    ->get()
                    ->getResultArray();